InformationRegisters/СерийныеНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СерийныеНомера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PINКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЗапросСерийногоКлюча/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйНомер = ОбщийМодуль.ПолучитьРегистрационныйНомер();
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Если Параметры.Свойство("Добавление") ИЛИ Параметры.Свойство("Продление") Тогда
		Если Параметры.Свойство("Добавление") Тогда
			Добавление = Истина;
		КонецЕсли;
		Если Параметры.Свойство("Продление") Тогда
			Продление = Истина;
		КонецЕсли;		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДобавленияПродления;
		Если Продление Тогда
			РегистрационныйНомер = Параметры.РегистрационныйНомер;	
			
		КонецЕсли;
		Если Добавление Тогда
			РегистрационныйНомер = "";
			Элементы.РегистрационныйНомер1.Видимость = Истина;
			Элементы.ИнформацияДляПолученияСерийногоНомера1.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонИнформации = 
	"Рег.номер: %1" + Символы.ПС + 
	"Путь к базе: %2" + Символы.ПС + 
	"Имя компьютера: %3"; 
	ИнформацияДляПолученияСерийногоНомера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИнформации, РегистрационныйНомер, НРег(СтрокаСоединенияИнформационнойБазы()), НРег(ИмяКомпьютера()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Добавление И НЕ Продление Тогда
		РезультатПроверки = ПроверкаКлюча();
		Если РезультатПроверки.Лицензия и РезультатПроверки.Поддержка  Тогда
			ОсталосьПоддержки = ОбщийМодуль.ПолучитьСрокЗавершенияПоддержки();
			Если ОсталосьПоддержки <= 30 И ОбщийМодульВызовСервера.ПроверитьСрокиНеНапоминатьОЗавершенииТехПоддержки() Тогда
				ОткрытьФормуМодально("ОбщаяФорма.ФормаТехническаяПоддержка", новый Структура("ПоказатьНеНапоминать", Истина));
			КонецЕсли;
			Закрыть();
		ИначеЕсли РезультатПроверки.Лицензия и НЕ РезультатПроверки.Поддержка  Тогда
			ОткрытьФормуМодально("ОбщаяФорма.ФормаТехническаяПоддержка");
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
	Если Добавление Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.РегистрационныйНомер
	ИначеЕсли Продление Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.СерийныйНомер1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы И НЕ Добавление И НЕ Продление Тогда
		РезультатПроверки = ПроверкаКлюча();
		Если НЕ РезультатПроверки.Лицензия Тогда
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	
	РезультатПроверки = ПроверкаКлюча();
	Если НЕ РезультатПроверки.Лицензия Тогда
		ПоказатьПредупреждение(,"Введен не верный серийный ключ");
		Возврат;
	КонецЕсли;
	Если НЕ РезультатПроверки.Поддержка Тогда
		ПоказатьПредупреждение(,"Внимание! Закончился срок поддержки вашей конфигурации. Вам необходимо обратиться к разработчику.");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	ОбщийМодуль.СохранитьPINКод(РегистрационныйНомер, PINКод);
КонецПроцедуры

&НаСервере
Функция ПроверкаКлюча()
	Возврат ОбщийМодуль.ОпределитьМассивПеременныхСеанса();
КонецФункции

&НаКлиенте
Процедура КомандаОкДобавлениеПродление(Команда)
	
	Если Продление Тогда
		ОК(Неопределено);		
	КонецЕсли;
	
	Если Добавление Тогда
		Если РегНомерУникален(РегистрационныйНомер) Тогда
			ОК(Неопределено);
		Иначе
			ТекстВопроса = "По данному регистрационному номеру имеется запись. Выполнить продление?";
			Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПродленияЛицензии", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РегНомерУникален(РегНомер)
	
	НаборЗаписей = РегистрыСведений.СерийныеНомера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистрационныйНомер.Установить(РегНомер);
	НаборЗаписей.Прочитать();
	Возврат НаборЗаписей.Количество() = 0;

КонецФункции

&НаКлиенте
Процедура ПослеВопросаОПродленияЛицензии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ОК(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
